---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetHCurveNormalAtStation(System.Double)
source: html/f665851a-c128-4f0e-806b-42a0c7505521.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetHCurveNormalAtStation Method

Calculate 2d (X and Y components of returned vector) horizontal normal at given station.

## Syntax (C#)
```csharp
public XYZ GetHCurveNormalAtStation(
	double station
)
```

## Parameters
- **station** (`System.Double`) - Alignment station to calculate 2d horizontal normal for, in Revit internal model units (standard Imperial feet).

## Returns
2d (X and Y components of returned vector) horizontal normal at given station.